[
    {
        "id": "new-broadcasting-license",
        "title": "CASF Secures Extended Broadcasting License",
        "date": "2026-02-05",
        "summary": "We are proud to announce that the station has successfully renewed its broadcasting license, ensuring community radio stays on the air.",
        "body": "The station management team is pleased to share the news that CASF has received a full five-year license renewal from regulatory authorities. This milestone is a testament to the hard work of our volunteers and the unwavering support of our listeners. We look forward to continuing our mission of providing live, human radio to the Central Valley.\n\nOver the coming months, we will be introducing several new programs focused on local history and youth voices. Stay tuned for more updates as we expand our broadcast schedule!"
    },
    {
        "id": "spring-membership-drive",
        "title": "Join the CASF Family: Spring Membership Drive",
        "date": "2026-02-08",
        "summary": "Our annual Spring Membership Drive starts next week! Help us keep community radio alive and well.",
        "body": "As a listener-supported non-profit station, CASF relies on your generosity to keep the lights on and the music playing. Starting Monday, we'll be hosting our annual membership drive. \n\nMemberships start at just $5 a month and come with exclusive perks, including early access to station events and a CASF window decal. Join today and help us maintain our independence and community focus. Every contribution, big or small, makes a significant difference in our ability to serve the Central Valley."
    },
    {
        "id": "local-artist-spotlight-series",
        "title": "Announcing the Local Artist Spotlight Series",
        "date": "2026-02-09",
        "summary": "Every Friday at 7 PM, we'll be featuring a different local artist from the valley in our new live performance series.",
        "body": "Music is the heart of CASF, and we want to celebrate the incredible talent right here in our backyard. Our new 'Local Artist Spotlight' series kicks off this Friday. \n\nEach week, a local musician or band will join us in the studio for a live performance and interview. We'll be exploring the stories behind their music and showcasing the vibrant sounds of our region. If you're a local artist interested in being featured, please reach out through our contact page!"
    }
]